renesas/rx-driver-package/source/r_tsip_rx_lib/r_tsip_rx_vx.xx/r_tsip_rx/src/targets/rx66t_rx72t/r_tsip_rx_private.h
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2015-2023 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : r_tsip_rx_private.h
 * Version      : 1.18
 * Description  : TSIP-Lite function private header file.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.10.2015 1.00     First Release
 *         : 15.05.2017 1.01     Add AES-CMAC
 *         : 30.09.2017 1.03     Change API name for TSIP V.1.03.
 *         : 28.02.2017 1.04     Change API to Init/Update/Final API
 *         : 28.09.2018 1.06     Add RSA Key Generation, AES, TDES, RSA Key update features, RX66T support
 *         : 28.12.2018 1.07     Add RX72T support
 *         : 30.09.2019 1.08     Added support for GCC and IAR compiler, ECC API, RX23W and RX72M
 *         : 31.03.2020 1.09     Added support for AES-CCM, HMAC key generation, ECDH, Key Wrap API, RX66N and RX72N
 *         : 30.06.2020 1.10     Added support for ARC4, ECC(P-384) API
 *         : 30.09.2020 1.11     Added support for DH, ECDHE P-512r1 API, and generalization of KDF.
 *         :                     Added support for Key wrap API with TSIP-Lite.
 *         : 30.06.2021 1.12     Added support for RX23W chip version D
 *         : 31.08.2021 1.13     Added support for RX671
 *         : 22.10.2021 1.14     Added support for TLS1.3
 *         : 31.03.2022 1.15     Added support for TLS1.3(RX72M_RX72N_RX66N)
 *         : 15.09.2022 1.16     Added support for RSA 3k/4k and updated support for TLS1.3
 *         : 20.01.2023 1.17     Added support for TLS1.3 server
 *         : 24.05.2023 1.18     Added support for RX26T
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include "r_tsip_rx_if.h"
#include "iodefine/r_tsip_rx66t_rx72t_iodefine.h"

#ifndef R_TSIP_RX_PRIVATE_HEADER_FILE
#define R_TSIP_RX_PRIVATE_HEADER_FILE

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
/* Depends on configuration */
#define TSIP_PRV_USE_AES_128_ECB_CBC_CTR (TSIP_AES_128_ECB_ENCRYPT || TSIP_AES_128_ECB_DECRYPT \
        || TSIP_AES_128_CBC_ENCRYPT || TSIP_AES_128_CBC_DECRYPT || TSIP_AES_128_CTR)
#define TSIP_PRV_USE_AES_256_ECB_CBC_CTR (TSIP_AES_256_ECB_ENCRYPT || TSIP_AES_256_ECB_DECRYPT \
        || TSIP_AES_256_CBC_ENCRYPT || TSIP_AES_256_CBC_DECRYPT || TSIP_AES_256_CTR)

#define TSIP_PRV_USE_AES_128_CCM (TSIP_AES_128_CCM_ENCRYPT || TSIP_AES_128_CCM_DECRYPT)
#define TSIP_PRV_USE_AES_256_CCM (TSIP_AES_256_CCM_ENCRYPT || TSIP_AES_256_CCM_DECRYPT)
#define TSIP_PRV_USE_AES_CCM     (TSIP_PRV_USE_AES_128_CCM || TSIP_PRV_USE_AES_256_CCM)

#define TSIP_PRV_USE_AES_128_GCM (TSIP_AES_128_GCM_ENCRYPT || TSIP_AES_128_GCM_DECRYPT)
#define TSIP_PRV_USE_AES_256_GCM (TSIP_AES_256_GCM_ENCRYPT || TSIP_AES_256_GCM_DECRYPT)
#define TSIP_PRV_USE_AES_GCM     (TSIP_PRV_USE_AES_128_GCM || TSIP_PRV_USE_AES_256_GCM)

#define TSIP_PRV_USE_AES_128 (TSIP_PRV_USE_AES_128_ECB_CBC_CTR || TSIP_AES_128_CMAC || TSIP_PRV_USE_AES_128_CCM \
        || TSIP_PRV_USE_AES_128_GCM || TSIP_AES_128_KEY_WRAP)
#define TSIP_PRV_USE_AES_256 (TSIP_PRV_USE_AES_256_ECB_CBC_CTR || TSIP_AES_256_CMAC || TSIP_PRV_USE_AES_256_CCM \
        || TSIP_PRV_USE_AES_256_GCM || TSIP_AES_256_KEY_WRAP)

/**********************************************************************************************************************
 Global Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 External global variables
 *********************************************************************************************************************/
extern uint32_t const S_FLASH[];

extern uint32_t S_RAM[R_TSIP_SRAM_WORD_SIZE];
extern uint32_t S_INST[R_TSIP_SINST_WORD_SIZE];
extern uint32_t S_INST2[R_TSIP_SINST2_WORD_SIZE];

extern TSIP_GEN_MAC_CB_FUNC_T TSIP_GEN_MAC_CB_FUNC;

/**********************************************************************************************************************
 Exported global functions
 *********************************************************************************************************************/
/* --------------------- TSIP driver wrapper layer ---------------------- */

